[
    {
        "name": "Smartphone Photography 101",
        "desc": "The sun is setting and the sky is alight with oranges and pinks, so you pull out your phone to snap a pic for the 'gram. But the photo just looks...meh. Find out how to maximise your cell phone's camera in this event featuring Shlomi Amiga, who will teach you the basics of photography. Learn how to find the best light, the science of angles and composition, and how to make your photos pop in this hybrid lecture. In-person attendees will then have the opportunity to photograph University College and the University of Toronto at sunset, then return for a reception and a chance to show off what they learned. In person attendees should bring a fully-charged smartphone to the event. Reserve your spot now by registering for this event today. Registration is required. MindSpark! Offering our alumni ways to learn, interact, and reconnect with UC through unique and engaging events.",
        "location": "University College, 15 King’s College Circle, Toronto ON M5S 3H7",
        "sorting_info": [
            1745432400,
            "Alumni",
            "University College"
        ],
        "posted_time": 0,
        "image": "https://www.uc.utoronto.ca//sites/default/files/styles/banner_scale_width_crop_1460/public/assets/banners/content/Smartphone%20Photography%20Banner%203%20v3.png?itok=wjdUeTDx"
    },
    {
        "name": "Morley Gunderson Lecture in Industrial Relations and Labour Economics",
        "desc": "Join us on Thursday, April 3rd for the 2025 Morley Gunderson Lecture in Industrial Relations and Labour Economics,&nbsp;Time: At Work and Not at Work, delivered by Daniel Hamermesh, professor emeritus of economics at Royal Holloway University of London &amp; University of Texas at Austin.",
        "location": "Online & at the Paul Cadario Conference Centre, University College, 15 King's College Circle, Toronto, ON M5S 3H7",
        "sorting_info": [
            1712121600,
            "Alumni",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca//sites/default/files/styles/scale_width_811px_/public/assets/images/Blue%20and%20Pink%20Professional%20Business%20Strategy%20Presentation.jpg?itok=xbMdJWMC"
    },
    {
        "name": "America Is Being Beaten: Visions of the Imperiled Child in Freud, D.W. Griffith, and Arthur Jafa.",
        "desc": "Ara Osterweil is a writer, painter, and scholar of 20th-21st century film and art, and an Associate Professor at McGill University.",
        "location": "Room 222E, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1712142000,
            "Town Hall",
            "Innis College"
        ],
        "posted_time": 1711312205,
        "image": "https://innis.utoronto.ca/wp-content/uploads/1-Painter-Ara-Osterweil-in-front-of-her-Meridien-100-x-90.-Photo-by-David-Baumflek.-@davidbaumflek_studio.jpeg"
    },
    {
        "name": "Public talk: Urban organisms. Re-imagining urban ecologies and collective futures with Kaethe Wenzel",
        "desc": "Join us on March 27 at U of T's The Fields Institute for Research in Mathematical Sciences for a public talk with Berlin-based artist Kaethe Wenzel on Urban organisms. Re-imagining urban ecologies and collective futures . RSVP Today!",
        "location": "The Fields Institute for Research in Mathematical Sciences, Rm. 230- 222 College Street",
        "sorting_info": [
            1711534800,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 1710196316,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/KaetheWenzel-Cell-Image.png"
    },
    {
        "name": "Urban Pictograms Workshop with Kaethe Wenzel",
        "desc": "A workshop to challenge the urban rules and cultural stereotypes of street signs. Join us March 20 with Berlin-based artist Kaethe Wenzel as she challenges the urban rules and cultural stereotypes of street signs in an interactive workshop at U of T's William Doo Auditorium. Register today!",
        "location": "William Doo Auditorium, New College at 45 Willcocks Street",
        "sorting_info": [
            1710923400,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 1710253775,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/Poster-Kaethe-Wenzel-370-x-270-px-1.png"
    },
    {
        "name": "2025-26 Neil Graham Lecture in Science",
        "desc": "The Neil Graham Lecture series was established through the generosity of Mr. Neil Graham, a 1930 graduate of University College and a former teacher of high school mathematics. 2025 event details forthcoming.",
        "location": null,
        "sorting_info": [
            1761195600,
            "Endowed Lecture Series",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "2nd Annual Woodsworth Alumni Game Night!",
        "desc": "Calling all Woodsworth alumni—it’s time to press play on an unforgettable night of friendly competition, nostalgia, and great company! Whether you’re a board game strategist, an arcade legend, or just in it for the laughs, this event is your chance to relive the best kind of campus rivalry—minus the exams and 8 a.m. classes.This isn’t just another game night—it’s the ultimate alumni experience. Here’s what’s in store:All-you-can-play access to classic and modern gamesDrink ticket and appetizers—because you play better when you are happyA room full of fellow alumni—reconnect, reminisce, and maybe settle some old scoresThe ultimate throwback experience—minus the exams and 8 a.m. classes, WooHoo!Event DetailsDate: Thursday, April 24Location: FreePlay Toronto (300 College St) Time: 6:00 PM – 9:00 PMTickets: $15 (Includes cover, unlimited free play, one premium drink ticket, and appetizers)Whether you're looking to dominate the competition or just enjoy a laid-back evening with fellow alumni, this is an event you don’t want to miss. Tickets are limited, so secure yours now and get ready for a night of games, memories, and fun!RSVP by April 10th, 2025—spots are limited!",
        "location": "FreePlay Toronto, 300 College St, Toronto, ON, M5T 1R9",
        "sorting_info": [
            1745488800,
            "Alumni",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca/sites/default/files/styles/headshot_1_1_800/public/assets/images/55119b89-cbb2-b40b-1656-d2dfd7c0b606.png?itok=G-ji1z52"
    },
    {
        "name": "2025-26 W. J. Alexander Lecture in English Literature",
        "desc": "The Alexander Lectures were founded in 1928 in memory of Professor W.J. Alexander, Head of the Department of English at University College from 1889 to 1926.",
        "location": null,
        "sorting_info": [
            1774915200,
            "Uncategorized",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "Will and Harper Screening",
        "desc": "Commemorate International Transgender Day of Visibility, in community. Out@Innis invites you to watch a free screening of the award-winning documentary, Will and Harper (2024), starring Harper Steele and Will Ferrell on a cross-country road trip. Arrive early for snacks. Stick around for a Q&A after the screening with Angie Fazekas, assistant professor at the Women and Gender Studies Institute (pictured). Monday, March 31 6–8:30pm (doors open at 5:30)Screening Room 222E, Innis College, 2 Sussex Ave.This event is open to all U of T students and staff, but space is limited. Registration is first come, first served. This film includes depictions and discussions of transphobia. Should you need any support during or following the event, Innis College’s assistant dean – community wellness will be present.A student-staff 2SLGBTQ+ advocacy group, making our college an even more inclusive and positive placeIn 2024, a group of students and staff came together to form Out@Innis with a shared mission to:Foster sense of belonging among 2SLGBTQ+ community members at Innis College.Bring visibility to 2SLGBTQ+-supporting resources and opportunities at Innis College and U of T.Tell inspiring stories of 2SLGBTQ+ journeys within the college and university communities.Advocate for equitable access to all aspects of an Innis College and U of T learning experience for 2SLGBTQ+ communities.",
        "location": "Screening Room 222E, Innis College, 2 Sussex Ave",
        "sorting_info": [
            1743441600,
            "Uncategorized",
            "Innis College"
        ],
        "posted_time": 1709574491,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Angie-Fazekas-1024x1024.png"
    },
    {
        "name": "“Flourishing Kin” Indigenous Lifeways to Collective Flourishing with Dr. Yuria Celidwen",
        "desc": "How can Western and Indigenous sciences work together to recalibrate current practices in service of global well-being?Join Dr. Yuria Celidwen on Tuesday, March 18 from 5 – 7 PM at Seely Hall, Trinity College to explore relationality and flourishing through cultivating relationships toward all kin, from human to more-than-human.Our world faces crises that require a focus on community and planetary health and well-being, but the Western mindfulness movement is primarily focused on individual self-improvement. Dr. Yuria Celidwen will share insights from her recent book Flourishing Kin: Indigenous Wisdom for Collective Well-Being, bridging Indigenous ontologies and methodologies, academic research, and poetic expression to cultivate sustainable collective flourishing through Indigenous contemplative spiritualities and sciences. Celidwen defines relationality and flourishing as a spiritual-aesthetic arrest only possible in community through cultivating relationships toward all kin, from human to more-than-human, and the living Earth. Through poetic expression and authentic truth-telling, Celidwen invites a path that meets the world’s complexity with reverence and joyous participation in the flourishing of all living beings – RSVP Today!Event Details: Date: Tuesday, March 18, 2025Time: 5:00 – 7:00 PM ETLocation: Seely Hall, Trinity College, University of Toronto – 6 Hoskin Avenue, TorontoMeet the Speaker: Dr. Yuria Celidwen - I am a native of the Indigenous Nahua and Maya lineages from the cloud forests of Chiapas, Mexico. I am of Earth; my heart is on fire. My family is one of mystics, healers, poets, and explorers of the soil and the soul of life’s strength, tenderness, and fragility. I grew up with one wing in the wilderness and another in the magical realism of Indigenous dreamlands and stories. My Elders’ songs enthralled my childhood and enhanced my mythic imagination and emotional intuition. They’ve become the fertile soils and waters where the seeds of reverence, play, and wonder dig their roots. I am a Truth-bearer, trickster dreamer, and culture-shifter. As a scholar, I research Indigenous forms of contemplation and the transcendent experience embodied in prosocial behavior (reverence, ethics, compassion, and a sense of awe, love, and sacredness).‎ I call my research broader statement the “Ethics of Belonging,” encouraging awareness, intention, and relational actions toward planetary flourishing and a path of meaning and participation rooted in honoring Life. I am affiliated with the Department of Psychology at the University of California, Berkeley, where I research Earth-based contemplation and collective flourishing in Indigenous traditions of the world. Alongside this, I am a senior fellow at the Othering and Belonging Institute; and for the American Academy of Religion, I co-chair the Indigenous Religious Traditions Unit and am on the steering committee of the Contemplative Studies Unit.RSVP Today!We would like to thank New College Initiatives Fund, the Buddhism, Psychology and Mental Health Program, EASELab, the Khyentse Foundation, Trinity College’s Integrated Sustainability Initiative, the School of the Environment, and the Robert H.N. Ho Family Foundation Centre for Buddhist Studies for their collaboration on this event.",
        "location": "Seeley Hall, Trinity College - 6 Hoskin Avenue. Toronto",
        "sorting_info": [
            1710786000,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 1741096773,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/Dr.YuriaCelidwen-400x400-1.png"
    },
    {
        "name": "Academic Bridging Program Info Session",
        "desc": "Curious to learn more about the Academic Bridging Program? Ask your questions at one of our virtual information sessions. The next info session will take place April 1, 2025.",
        "location": "Online",
        "sorting_info": [
            1711938000,
            "Alumni",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca/sites/default/files/styles/landscape_16_7_1326x663/public/assets/images/Stocksy_txp3908a772dhQ300_OriginalDelivery_1032694.jpg?itok=DCb2g786"
    },
    {
        "name": "Innis Leadership Awards Application Deadline",
        "desc": "Get the recognition you’ve earned. Apply for Innis leadership awards. Have you volunteered at the College, on campus, or in your community? Innis wants to hear about your contributions and recognize you. Take a look at our many leadership awards. Ranging from approximately $500 to $11,000, we have awards for students in all years. The… Continue Reading Innis Leadership Awards Application Deadline",
        "location": null,
        "sorting_info": [
            1713146340,
            "Uncategorized",
            "Innis College"
        ],
        "posted_time": 1708915093,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Innis-College-Early-Years-Convocation-7-1024x576.jpg"
    },
    {
        "name": "CINSSU presents: Free Friday Film – All the President’s Men",
        "desc": "CINSSU presents: Free Friday Film –  All The President’s Men with an introduction from Prof. Mike Meneghetti. Free and open to all!",
        "location": "Innis Town Hall, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1743361200,
            "Uncategorized",
            "Innis College"
        ],
        "posted_time": 1711301438,
        "image": "https://innis.utoronto.ca/wp-content/uploads/thumbnail_fff-all-the-pres_wide-1024x576.jpg"
    },
    {
        "name": "Wake Up Toronto – Mindfulness Practice Session: in-person",
        "desc": "Wake Up Toronto is a mindfulness group that practices in the tradition of Engaged Mindfulness, founded by internationally recognized scholar, peace activist and Zen Master Thich Nhat Hanh. We are a branch of the international Wake Up initiative which fosters inclusive spaces for developing compassionate communities.The Wake Up initiative is for young adults in their 20s and 30s-ish.Open to students, faculty, staff and the general public. The skillsets and aims of our practice group align with several of the recommendations made by the University of Toronto’s Mental Health Task force.Speakers/facilitators for these sessions are comprised of students, faculty and community members trained in the mindfulness tradition of Thich Nhat Hanh and Plum Village.New and long-term meditators welcome! Each week we explore different topics, try out a variety of practices and have time for discussion and community connection.Join us for Wake Up Toronto on Mondays for an in-person Mindfulness Practice Session.Location: 569 Spadina Avenue, Multi-Faith Centre 2nd floor, Main Activity HallRegistration is not required. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Upcoming in-person Mindfulness Practice Sessions: Monday, March 31 - 8 - 9:30 p.mMonday, April 14 - 8 - 9:30 p.m.Monday, April 28 - 8 - 9:30 p.m.For the latest news and updates, please visit: https://www.wakeuptoronto.ca/ or follow on social media: Facebook & Instagram",
        "location": "569 Spadina Avenue, Main Activity Hall, 2nd Floor",
        "sorting_info": [
            1711862400,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 1697741792,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/Mindfulness-Practice-Sessions-inperson-400x400.png?x76399"
    },
    {
        "name": "EASE Lab Research Meeting – March",
        "desc": "Join us for our monthly research meeting (plus snacks and social time), with a research presentation by Marybel Menzies, plus an open discussion of the Lab’s future, and an info session about this summer’s Plum Village science retreat.",
        "location": "Hybrid (in-person and online options) - check below for details",
        "sorting_info": [
            1710682800,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 1710260517,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/EASE-lab-March-20251.png"
    },
    {
        "name": "Kensington Market: Heart of the City",
        "desc": "The Urban Studies Program and the Canadian Film Forum present a special screening of Kensington Market: Heart of the City. On April 8, join for a screening of this documentary film followed by a discussion with filmmaker Stuart Clarfield. Kensington Market: Heart of the City tells the story of generations who have lived in the neighbourhood over the last 160 years, the personalities present today, and the forces that are impacting the market’s future. This film explores the rich community in the market, the pressures it faces under developers and landlords, and hopes to activate audiences to help protect the market for generations to come.",
        "location": "Innis Town Hall, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1744167600,
            "Alumni",
            "Innis College"
        ],
        "posted_time": 1710047741,
        "image": "https://innis.utoronto.ca/wp-content/uploads/KM-16-9-Poster-BG-Large-1024x600.jpeg"
    },
    {
        "name": "2025 Innis Alumni Lecture",
        "desc": "Join us on April 9 for our 2025 Innis Alumni Lecture, “Can ‘Ex-Cons’ Help Improve the Criminal Justice System?“, with Professor Jeffrey Ian Ross (BA ’85 Innis). The criminal justice system struggles with entrenched issues that demand a fundamental re-evaluation. What if we used the voices of well-educated formerly incarcerated individuals to drive meaningful reform? Drawing from the Convict Criminology perspective, which amplifies the voices of those who have lived experience, this talk will explore how CJS reform could be improved by incorporating their expertise.",
        "location": "Innis Town Hall, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1712655600,
            "Alumni",
            "Innis College"
        ],
        "posted_time": 1710120474,
        "image": "https://innis.utoronto.ca/wp-content/uploads/2025-Alumni-Lecture-Event-Page-Banner-1-1024x576.jpg"
    },
    {
        "name": "Write Night",
        "desc": "Are those end-of-term deadlines adding up? Join us for an evening filled with focused, friendly, stress-free support whether you're still settling on a research topic, drafting final papers or making final revisions we have the tools to help get over those final finish lines. Write Night combines the best of what the Writing Centre and Library have to offer plus a few extra exciting additions: On-the-spot, one-on-one consultations with writing instructors and librarians Quiet spaces to write alongside peers Mindfulness activities and wellness breaks to recharge your body and mind Helpful strategies to meet deadlines no matter where you are in the process Writing Workshops Raffle prizes And dinner is on us for all pre-registered attendees! (catered) Join us as we take over the library and tackle those deadlines head-on - Register Now! Write Night is open to New College students and students enrolled in a New College-affiliated program or course (Critical Studies in Equity and Solidarity, NewOne, BPMH, African Studies, Caribbean Studies, Women Genders, or Human Biology) working on papers.",
        "location": "D.G. Ivey Library, New College - 20 Willcocks Street",
        "sorting_info": [
            1711454400,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 1698696307,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/WriteNight_370x270.png"
    },
    {
        "name": "VWA | Victoria Women's Association Annual Luncheon",
        "desc": "Celebrate 127 years of the VWA with the Vic community over lunch and enjoy \"Women and Art at Victoria University,\" a talk by Gerrie Loveys.",
        "location": "Alumni Hall",
        "sorting_info": [
            1713267600,
            "Uncategorized",
            "Victoria College"
        ],
        "posted_time": 1737512497,
        "image": "https://www.vicu.utoronto.ca/assets/Uploads/burwash.jpg"
    },
    {
        "name": "Toronto Serbian Film Festival – Pun Gas!//First Class: Full Speed!",
        "desc": "Rivals Beba and Nemac as they race iconic Yugos, chasing the national championship and their dreams of Formula 1.",
        "location": "Innis Town Hall, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1711715400,
            "Uncategorized",
            "Innis College"
        ],
        "posted_time": 1709005160,
        "image": "https://innis.utoronto.ca/wp-content/uploads/24th-TSFF-_Students_1920x1080-1024x576.png"
    },
    {
        "name": "Victoria College Open House | Open Vic 2025",
        "desc": "Join us at our annual Open Vic on Saturday, June 14, from 10 a.m. to 4 p.m. We will be welcoming incoming students and their guests to campus for an afternoon filled with meet and greets, academic advising, tours, information booths and more. Lunch will be served. This event is for Faculty of Arts & Science students who are admitted to Victoria College for the 2025-26 academic year.",
        "location": "Old Vic, 73 Queen's Park Crescent, Toronto, Ont.",
        "sorting_info": [
            1718355600,
            "Uncategorized",
            "Victoria College"
        ],
        "posted_time": 0,
        "image": "https://www.vicu.utoronto.ca/assets/Uploads/Vic-U-News/open-vic-victoria-college.jpeg"
    },
    {
        "name": "Toronto Serbian Film Festival – Devil’s Town // Djavolja Varos",
        "desc": "Join us for a special retrospective screening of Devil’s Town (Đavolja Varoš) with director Vlada Paskaljević in-person to share bts stories.",
        "location": "Innis Town Hall, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1712343600,
            "Town Hall",
            "Innis College"
        ],
        "posted_time": 1772132714,
        "image": "https://innis.utoronto.ca/wp-content/uploads/24th-TSFF-_Students_1920x1080-1024x576.png"
    },
    {
        "name": "Masked at the Movies presents Marcel the Shell with Shoes On",
        "desc": "A mask-mandatory screening of Marcel the Shell With Shoes On.",
        "location": "Innis Town Hall, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1711816800,
            "Town Hall",
            "Innis College"
        ],
        "posted_time": 1711364979,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Masked-At-The-Movies-Marcel-1-1024x576.png"
    },
    {
        "name": "Research Day 2025",
        "desc": "Victoria College’s annual Research Day will take place on March 31, 2025. Research Day brings together Vic students from all disciplines and provides an opportunity to share your work with fellow students, professors, and the wider Vic community. If you have been conducting research in any discipline, you are encouraged to submit a proposal for an interdisciplinary poster session. All Vic students, and any students enrolled in Victoria College programs, are eligible to participate.",
        "location": "Victoria College Alumni Hall/ Foyer",
        "sorting_info": [
            1711845600,
            "Uncategorized",
            "Victoria College"
        ],
        "posted_time": 1737512497,
        "image": "https://www.vicu.utoronto.ca//assets/Uploads/Vic-U-News/Call-for-Applications-1.png"
    }
]