[
    {
        "name": "2025-26 Neil Graham Lecture in Science",
        "desc": "The Neil Graham Lecture series was established through the generosity of Mr. Neil Graham, a 1930 graduate of University College and a former teacher of high school mathematics.",
        "location": null,
        "sorting_info": [
            1761196800,
            "Uncategorized",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "Academic Bridging Program Info Session",
        "desc": "Curious to learn more about the Academic Bridging Program? Ask your questions at one of our virtual information sessions. The next info session will take place April 1, 2025.",
        "location": "Online",
        "sorting_info": [
            1711924800,
            "Alumni",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca/sites/default/files/styles/landscape_16_7_1326x663/public/assets/images/Stocksy_txp3908a772dhQ300_OriginalDelivery_1032694.jpg?itok=DCb2g786"
    },
    {
        "name": "Morley Gunderson Lecture in Industrial Relations and Labour Economics",
        "desc": "Join us on Thursday, April 3rd for the 2025 Morley Gunderson Lecture in Industrial Relations and Labour Economics,&nbsp;Time: At Work and Not at Work, delivered by Daniel Hamermesh, professor emeritus of economics at Royal Holloway University of London & University of Texas at Austin.We will also award the&nbsp;Morley Gunderson Prize&nbsp;which honours current students or alumni who combine outstanding personal achievement with significant service to the Centre.This is a free event and all are welcome. This event is sold out for in-person. You may attend virtually via livestream.Time is our scarcest resource.&nbsp;Compared to income, the amount of time at our disposal has grown much less rapidly over the last century. That’s true in rich countries, like Canada and the U.S., but is increasingly also true in less developed countries. For the average working adult, work time constitutes barely 20 percent of the typical week.&nbsp;It is only the second most common activity, being far behind sleep time, but slightly ahead of TV-watching; and yet, economists and others analyze work time much more thoroughly than the more important non-work time. This lecture discusses both work and non-work, concentrating particularly on differences in how time is spent across such characteristics as gender, age, immigrant status, and income, and on how it is used differently across counties. Dr. Daniel Hamermesh&nbsp;focuses on how the shortage of time affects behavior, and how these effects differ across these same demographic and economic characteristics. He asks the question: What would we do with the extra time if we suddenly got more time each day, week, or year? The answer is surprising and fairly distressing, but his talk culminates with&nbsp;a discussion of policies that might make the increasing scarcity of time less burdensome.",
        "location": "Online & at the Paul Cadario Conference Centre, University College, 15 King's College Circle, Toronto, ON M5S 3H7",
        "sorting_info": [
            1712131200,
            "Alumni",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca//sites/default/files/styles/scale_width_811px_/public/assets/images/Blue%20and%20Pink%20Professional%20Business%20Strategy%20Presentation.jpg?itok=xbMdJWMC"
    },
    {
        "name": "2nd Annual Woodsworth Alumni Game Night!",
        "desc": "Calling all Woodsworth alumni—it’s time to press play on an unforgettable night of friendly competition, nostalgia, and great company! Whether you’re a board game strategist, an arcade legend, or just in it for the laughs, this event is your chance to relive the best kind of campus rivalry—minus the exams and 8 a.m. classes.This isn’t just another game night—it’s the ultimate alumni experience. Here’s what’s in store:All-you-can-play access to classic and modern gamesDrink ticket and appetizers—because you play better when you are happyA room full of fellow alumni—reconnect, reminisce, and maybe settle some old scoresThe ultimate throwback experience—minus the exams and 8 a.m. classes, WooHoo! Date: Thursday, April 24Location: Free Play Toronto (300 College St) Time: 6:00 PM – 9:00 PMTickets: $15 (Includes cover, unlimited free play, one premium drink ticket, and appetizers)Whether you're looking to dominate the competition or just enjoy a laid-back evening with fellow alumni, this is an event you don’t want to miss. Tickets are limited, so secure yours now and get ready for a night of games, memories, and fun!RSVP by April 10th, 2025—spots are limited!",
        "location": "FreePlay Arcade, 300 College St, Toronto, ON, M5T 1R9",
        "sorting_info": [
            1745515200,
            "Alumni",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca/sites/default/files/styles/headshot_1_1_800/public/assets/images/55119b89-cbb2-b40b-1656-d2dfd7c0b606.png?itok=G-ji1z52"
    },
    {
        "name": "Kensington Market: Heart of the City",
        "desc": "The Urban Studies Program and the Canadian Film Forum present a special screening of Kensington Market: Heart of the City. On April 8, join for a screening of this documentary film followed by a discussion with filmmaker Stuart Clarfield. Kensington Market: Heart of the City tells the story of generations who have lived in the neighbourhood over the last 160 years, the personalities present today, and the forces that are impacting the market’s future. This film explores the rich community in the market, the pressures it faces under developers and landlords, and hopes to activate audiences to help protect the market for generations to come.",
        "location": "Innis Town Hall, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1744161600,
            "Alumni",
            "Innis College"
        ],
        "posted_time": 1741593341,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Stuart-Clarfield-Cropped-Headshot.png"
    },
    {
        "name": "2025 Innis Alumni Lecture",
        "desc": "Join us on April 9 for our 2025 Innis Alumni Lecture, “Can ‘Ex-Cons’ Help Improve the Criminal Justice System?“, with Professor Jeffrey Ian Ross (BA ’85 Innis). The criminal justice system struggles with entrenched issues that demand a fundamental re-evaluation. What if we used the voices of well-educated formerly incarcerated individuals to drive meaningful reform? Drawing from the Convict Criminology perspective, which amplifies the voices of those who have lived experience, this talk will explore how CJS reform could be improved by incorporating their expertise.",
        "location": "Innis Town Hall, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1712668800,
            "Alumni",
            "Innis College"
        ],
        "posted_time": 1710101274,
        "image": "https://innis.utoronto.ca/wp-content/uploads/2025-Alumni-Lecture-Event-Page-Banner-1-1024x576.jpg"
    },
    {
        "name": "Innis Leadership Awards Application Deadline",
        "desc": "Get the recognition you've earned. Apply for Innis leadership awards. Have you volunteered at the College, on campus, or in your community? Innis wants to hear about your contributions and recognize you. Take a look at our many leadership awards. Ranging from approximately $500 to $11,000, we have awards for students in all years.",
        "location": null,
        "sorting_info": [
            1713095940,
            "Uncategorized",
            "Innis College"
        ],
        "posted_time": 1710811093,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Innis-College-Early-Years-Convocation-7-1024x576.jpg"
    },
    {
        "name": "CINSSU presents: Free Friday Film – All the President’s Men",
        "desc": "CINSSU presents: Free Friday Film –  All The President’s Men with an introduction from Prof. Mike Meneghetti. Free and open to all!",
        "location": "Innis Town Hall, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1743361200,
            "Uncategorized",
            "Innis College"
        ],
        "posted_time": 1711291838,
        "image": "https://innis.utoronto.ca/wp-content/uploads/thumbnail_fff-all-the-pres_wide-1024x576.jpg"
    },
    {
        "name": "Masked at the Movies presents Marcel the Shell with Shoes On",
        "desc": "A mask-mandatory screening of Marcel the Shell With Shoes On.",
        "location": "Innis Town Hall, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1711809600,
            "Town Hall",
            "Innis College"
        ],
        "posted_time": 1711806418,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Masked-At-The-Movies-Marcel-1-1024x576.png"
    },
    {
        "name": "CSI 50th Anniversary Screening Series: Splice",
        "desc": "The Cinema Studies Institute celebrates its 50th anniversary with a screening series of films picked by notable CSI alumni. Screenings will be followed by a discussion between the alumni and a CSI faculty member. All are welcome. Seats are first come, first serve. Doors open at 6:30pm. Claim your free ticket at Eventbrite. Splice is a 2009 science fiction horror film directed by Vincenzo Natali and starring Adrien Brody, Sarah Polley, and Delphine Chanéac. The story concerns experiments in genetic engineering being done by a young scientific couple, who attempt to introduce human DNA into their work of splicing animal genes resulting in the creation of a human–animal hybrid. Magali Simard is the Director of Industry Relations at Cinespace Studios, Toronto’s largest production facilty. She is the former Film Sector Development Program Manager for the City of Toronto where she led economic and creative development activities to amplify the international competitiveness of the City’s $2.5B Screen sector. Prior to joining the City, Magali was a lead curator and the senior manager of theatrical programming at the Toronto International Film Festival. Magali graduated as a Cinema Studies Specialist in 2006. Moderator, Kate J. Russell completed a PhD at the Cinema Studies Institute.",
        "location": "Innis Town Hall, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1711867200,
            "Town Hall",
            "Innis College"
        ],
        "posted_time": 1701732653,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Splice-static-image-with-Simard-and-Russell-QR-code-Mar19-1024x576.jpg"
    },
    {
        "name": "Will and Harper Screening",
        "desc": "Commemorate International Transgender Day of Visibility,",
        "location": "Room 222E, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1711857600,
            "Town Hall",
            "Innis College"
        ],
        "posted_time": 1709741534,
        "image": "https://innis.utoronto.ca/wp-content/uploads/WILL-HARPER-1-2-1024x576.png"
    },
    {
        "name": "America Is Being Beaten: Visions of the Imperiled Child in Freud, D.W. Griffith, and Arthur Jafa.",
        "desc": "Ara Osterweil is a writer, painter, and scholar of 20th-21st century film and art, and an Associate Professor at McGill University.",
        "location": "Room 222E, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1712142000,
            "Town Hall",
            "Innis College"
        ],
        "posted_time": 1711312205,
        "image": "https://innis.utoronto.ca/wp-content/uploads/1-Painter-Ara-Osterweil-in-front-of-her-Meridien-100-x-90.-Photo-by-David-Baumflek.-@davidbaumflek_studio.jpeg"
    },
    {
        "name": "Public talk: Urban organisms. Re-imagining urban ecologies and collective futures with Kaethe Wenzel",
        "desc": "Join us on March 27 at U of T's The Fields Institute for Research in Mathematical Sciences for a public talk with Berlin-based artist Kaethe Wenzel on Urban organisms. Re-imagining urban ecologies and collective futures . RSVP Today!",
        "location": "The Fields Institute for Research in Mathematical Sciences, Rm. 230- 222 College Street",
        "sorting_info": [
            1711518000,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 1710196325,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/KaetheWenzel-Cell-Image.png"
    },
    {
        "name": "Write Night",
        "desc": "Are those end-of-term deadlines adding up? The New College Writing Centre and D.G. Ivey Library have teamed up for the return of Write Night on Wednesday, March 26 in the D.G. Ivey Library from 4:30-9 p.m. Join us for an evening filled with focused, friendly, stress-free support whether you're still settling on a research topic, drafting final papers or making final revisions we have the tools to help get over those final finish lines. Write Night combines the best of what the Writing Centre and Library have to offer plus a few extra exciting additions:&gt; On-the-spot, one-on-one consultations with writing instructors and librarians&gt; Quiet spaces to write alongside peers&gt; Mindfulness activities and wellness breaks to recharge your body and mind&gt; Helpful strategies to meet deadlines no matter where you are in the process&gt; Writing Workshops&gt; Raffle prizes&gt; And dinner is on us for all pre-registered attendees! (catered) Join us as we take over the library and tackle those deadlines head-on - Register Now!Write Night is open to New College students and students enrolled in a New College-affiliated program or course (Critical Studies in Equity and Solidarity, NewOne, BPMH, African Studies, Caribbean Studies, Women Genders, or Human Biology) working on papers.",
        "location": "D.G. Ivey Library, New College - 20 Willcocks Street",
        "sorting_info": [
            1711416600,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 1698696307,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/WriteNight_370x270.png"
    },
    {
        "name": "“Flourishing Kin” Indigenous Lifeways to Collective Flourishing with Dr. Yuria Celidwen",
        "desc": "How can Western and Indigenous sciences work together to recalibrate current practices in service of global well-being? Join Dr. Yuria Celidwen on Tuesday, March 18 from 5 – 7 PM at Seely Hall, Trinity College to explore relationality and flourishing through cultivating relationships toward all kin, from human to more-than-human. Our world faces crises that require a focus on community and planetary health and well-being, but the Western mindfulness movement is primarily focused on individual self-improvement. Dr. Yuria Celidwen will share insights from her recent book Flourishing Kin: Indigenous Wisdom for Collective Well-Being, bridging Indigenous ontologies and methodologies, academic research, and poetic expression to cultivate sustainable collective flourishing through Indigenous contemplative spiritualities and sciences. Celidwen defines relationality and flourishing as a spiritual-aesthetic arrest only possible in community through cultivating relationships toward all kin, from human to more-than-human, and the living Earth.  Through poetic expression and authentic truth-telling, Celidwen invites a path that meets the world’s complexity with reverence and joyous participation in the flourishing of all living beings – RSVP Today! Event Details:  Date: Tuesday, March 18, 2025 Time: 5:00 – 7:00 PM ET Location: Seely Hall, Trinity College, University of Toronto – 6 Hoskin Avenue, Toronto Meet the Speaker:  Dr. Yuria Celidwen - I am a native of the Indigenous Nahua and Maya lineages from the cloud forests of Chiapas, Mexico. I am of Earth; my heart is on fire. My family is one of mystics, healers, poets, and explorers of the soil and the soul of life’s strength, tenderness, and fragility. I grew up with one wing in the wilderness and another in the magical realism of Indigenous dreamlands and stories. My Elders’ songs enthralled my childhood and enhanced my mythic imagination and emotional intuition. They’ve become the fertile soils and waters where the seeds of reverence, play, and wonder dig their roots. I am a Truth-bearer, trickster dreamer, and culture-shifter. As a scholar, I research Indigenous forms of contemplation and the transcendent experience embodied in prosocial behavior (reverence, ethics, compassion, and a sense of awe, love, and sacredness).‎ I call my research broader statement the “Ethics of Belonging,” encouraging awareness, intention, and relational actions toward planetary flourishing and a path of meaning and participation rooted in honoring Life. I am affiliated with the Department of Psychology at the University of California, Berkeley, where I research Earth-based contemplation and collective flourishing in Indigenous traditions of the world. Alongside this, I am a senior fellow at the Othering and Belonging Institute; and for the American Academy of Religion, I co-chair the Indigenous Religious Traditions Unit and am on the steering committee of the Contemplative Studies Unit. RSVP Today! We would like to thank New College Initiatives Fund, the Buddhism, Psychology and Mental Health Program, EASELab, the Khyentse Foundation, Trinity College’s Integrated Sustainability Initiative, the School of the Environment, and the Robert H.N. Ho Family Foundation Centre for Buddhist Studies for their collaboration on this event.",
        "location": "Seeley Hall, Trinity College - 6 Hoskin Avenue. Toronto",
        "sorting_info": [
            1710754800,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 1710750233,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/Dr.YuriaCelidwen-400x400-1.png"
    },
    {
        "name": "EASE Lab Research Meeting – March",
        "desc": "Join us for our monthly research meeting (plus snacks and social time), with a research presentation by Marybel Menzies, plus an open discussion of the Lab’s future, and an info session about this summer’s Plum Village science retreat.Marybel Menzies will be discussing the ethical significance of the minimally conscious state (MCS). To do this, she will respond to a position she names the \"fate worse than death view\". She will then analyze current neuroscientific evidence for mental state activity in patients diagnosed MCS, as well as perform a value theoretical analysis of these mental states to determine whether they are prudentially valuable. Menzies will show that research suggests MCS patients retain significant neural activity in regions associated with emotional processing. This preserved neural activity correlated with specific mental states that have prudential value—particularly, she argues that emotional states are prudentially valuable. To establish her position, she addresses two objections, including the inverse inference and adaptive preference objection. The conclusion has implications for clinical ethics and treatment decisions because it suggests that prudentially valuable mental states give rise to interests, which ought to be factored into decision-making by clinicians. Thus, while the ethical challenges surrounding MCS remain complex, Menzies suggests the presence of prudentially valuable mental states in these patients must be appreciated.No registration required!In person: Wilson Hall, Room 2053 - 20 Willcocks StreetOnline via Zoom: https://utoronto.zoom.us/j/86203812030 (meeting passcode: 423431)The EASE Lab is presented by New College's Buddhism, Psychology, and Mental Health Program and is a network of contemplative science researchers across U of T. The Lab supports interdisciplinary research on meditative and embodied practices , their histories and contexts globally, and their potential applications in society.",
        "location": "Hybrid (in-person and online options) - check below for details",
        "sorting_info": [
            1710651600,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 1710260517,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/EASE-lab-March-20251-400x400.png"
    },
    {
        "name": "Research Day 2025",
        "desc": "Victoria College’s annual Research Day will take place on March 31, 2025. Research Day brings together Vic students from all disciplines and provides an opportunity to share your work with fellow students, professors, and the wider Vic community. If you have been conducting research in any discipline, you are encouraged to submit a proposal for an interdisciplinary poster session. All Vic students, and any students enrolled in Victoria College programs, are eligible to participate.",
        "location": "Victoria College Alumni Hall/ Foyer",
        "sorting_info": [
            1711866000,
            "Uncategorized",
            "Victoria College"
        ],
        "posted_time": 1737512497,
        "image": "https://www.vicu.utoronto.ca//assets/Uploads/Vic-U-News/Call-for-Applications-1.png"
    },
    {
        "name": "VWA | Victoria Women's Association Annual Luncheon",
        "desc": "Celebrate 127 years of the VWA with the Vic community over lunch and enjoy \"Women and Art at Victoria University,\" a talk by Gerrie Loveys.",
        "location": "Alumni Hall",
        "sorting_info": [
            1713282000,
            "Uncategorized",
            "Victoria College"
        ],
        "posted_time": 0,
        "image": "https://www.vicu.utoronto.ca/assets/Uploads/burwash.jpg"
    },
    {
        "name": "Victoria College Open House | Open Vic 2025",
        "desc": "Join us at our annual Open Vic on Saturday, June 14, from 10 a.m. to 4 p.m. We will be welcoming incoming students and their guests to campus for an afternoon filled with meet and greets, academic advising, tours, information booths and more. Lunch will be served. This event is for Faculty of Arts & Science students who are admitted to Victoria College for the 2025-26 academic year.",
        "location": "Old Vic, 73 Queen's Park Crescent, Toronto, Ont.",
        "sorting_info": [
            1781496000,
            "Uncategorized",
            "Victoria College"
        ],
        "posted_time": 0,
        "image": "https://www.vicu.utoronto.ca//assets/Uploads/Vic-U-News/open-vic-victoria-college.jpeg"
    }
]