[
    {
        "name": "Smartphone Photography 101",
        "desc": "The sun is setting and the sky is alight with oranges and pinks, so you pull out your phone to snap a pic for the 'gram. But the photo just looks...meh. Find out how to maximise your cell phone's camera in this event featuring Shlomi Amiga, who will teach you the basics of photography. Learn how to find the best light, the science of angles and composition, and how to make your photos pop in this hybrid lecture. In-person attendees will then have the opportunity to photograph University College and the University of Toronto at sunset, then return for a reception and a chance to show off what they learned. In person attendees should bring a fully-charged smartphone to the event. Reserve your spot now by registering for this event today. Registration is required. MindSpark! Offering our alumni ways to learn, interact, and reconnect with UC through unique and engaging events.",
        "location": "University College, 15 King’s College Circle, Toronto ON M5S 3H7",
        "sorting_info": [
            1713848400,
            "Alumni",
            "University College"
        ],
        "posted_time": 0,
        "image": "https://www.uc.utoronto.ca//sites/default/files/styles/banner_scale_width_crop_1460/public/assets/banners/content/Smartphone%20Photography%20Banner%203%20v3.png?itok=wjdUeTDx"
    },
    {
        "name": "2025-26 W. J. Alexander Lecture in English Literature",
        "desc": "The Alexander Lectures were founded in 1928 in memory of Professor W.J. Alexander, Head of the Department of English at University College from 1889 to 1926.",
        "location": null,
        "sorting_info": [
            1774953600,
            "Endowed Lecture Series",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "2025-26 Neil Graham Lecture in Science",
        "desc": "The Neil Graham Lecture series was established through the generosity of Mr. Neil Graham, a 1930 graduate of University College and a former teacher of high school mathematics. 2025 event details forthcoming.",
        "location": null,
        "sorting_info": [
            1761195600,
            "Endowed Lecture Series",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    }
]