[
    {
        "name": "Toronto Aesthetics Sciences Conference (TASC) 2025",
        "desc": "Mark your calendars! Join us for the insightful Toronto Aesthetics Sciences Conference (TASC) on April 8th at the Paul Cadario Conference Centre at University College, from 8:30 AM to 5:30 PM. For more information, please click here. Please note that registration is required for this event. If you wish to present, please enter a title, authors, and an abstract (max. 1000 characters, about 200 words) for your work in the form. Due to limited presentation slots, we cannot guarantee that all submission requests will be accepted for presentation. Refreshments and lunch will be provided. Registration deadline: Friday, February 28, 2025 (11:59 PM)",
        "location": "Paul Cadario Conference Centre at University College",
        "sorting_info": [
            1741388400,
            "Academic",
            "University College"
        ],
        "posted_time": 0,
        "image": "https://www.uc.utoronto.ca/sites/default/files/styles/scale_width_content_600/public/assets/images/UofT87286_u-of-t-engineering_50814475202_o.jpg?itok=4XA_F3ZM"
    },
    {
        "name": "Smartphone Photography 101",
        "desc": "The sun is setting and the sky is alight with oranges and pinks, so you pull out your phone to snap a pic for the 'gram. But the photo just looks...meh. Find out how to maximise your cell phone's camera in this event featuring Shlomi Amiga, who will teach you the basics of photography. Learn how to find the best light, the science of angles and composition, and how to make your photos pop in this hybrid lecture. In-person attendees will then have the opportunity to photograph University College and the University of Toronto at sunset, then return for a reception and a chance to show off what they learned. In person attendees should bring a fully-charged smartphone to the event. Reserve your spot now by registering for this event today. Registration is required. MindSpark! Offering our alumni ways to learn, interact, and reconnect with UC through unique and engaging events.",
        "location": "University College, 15 King’s College Circle, Toronto ON M5S 3H7",
        "sorting_info": [
            1745368200,
            "Social",
            "University College"
        ],
        "posted_time": 0,
        "image": "https://www.uc.utoronto.ca/sites/default/files/styles/banner_scale_width_crop_1460/public/assets/banners/content/Smartphone%20Photography%20Banner%203%20v3.png?itok=wjdUeTDx"
    },
    {
        "name": "2025-26 Neil Graham Lecture in Science",
        "desc": "The Neil Graham Lecture series was established through the generosity of Mr. Neil Graham, a 1930 graduate of University College and a former teacher of high school mathematics. 2025 event details forthcoming.",
        "location": null,
        "sorting_info": [
            1761187200,
            "Academic",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "2025-26 W. J. Alexander Lecture in English Literature",
        "desc": "The Alexander Lectures were founded in 1928 in memory of Professor W.J. Alexander, Head of the Department of English at University College from 1889 to 1926. 2026 event details forthcoming.",
        "location": null,
        "sorting_info": [
            1775001600,
            "Academic",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "Academic Bridging Program Info Session",
        "desc": "Curious to learn more about the Academic Bridging Program? Ask your questions at one of our virtual information sessions. The next info session will take place April 1, 2025.",
        "location": "Online",
        "sorting_info": [
            1733076000,
            "Academic",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca/sites/default/files/styles/headshot_1_1_800/public/assets/images/Stocksy_txp3908a772dhQ300_Medium_2604619%20%282%29.jpg?itok=iKy1L7Q7"
    },
    {
        "name": "Morley Gunderson Lecture in Industrial Relations and Labour Economics",
        "desc": "Join us on Thursday, April 3rd for the 2025 Morley Gunderson Lecture in Industrial Relations and Labour Economics, Time: At Work and Not at Work, delivered by Daniel Hamermesh, professor emeritus of economics at Royal Holloway University of London & University of Texas at Austin. We will also award the Morley Gunderson Prize which honours current students or alumni who combine outstanding personal achievement with significant service to the Centre.",
        "location": "Online & at the Paul Cadario Conference Centre, University College, 15 King's College Circle, Toronto, ON M5S 3H7",
        "sorting_info": [
            1739568000,
            "Academic",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca/sites/default/files/styles/scale_width_811px_/public/assets/images/Blue%20and%20Pink%20Professional%20Business%20Strategy%20Presentation.jpg?itok=xbMdJWMC"
    },
    {
        "name": "2nd Annual Woodsworth Alumni Game Night!",
        "desc": "Calling all Woodsworth alumni—it’s time to press play on an unforgettable night of friendly competition, nostalgia, and great company! Whether you’re a board game strategist, an arcade legend, or just in it for the laughs, this event is your chance to relive the best kind of campus rivalry—minus the exams and 8 a.m. classes.",
        "location": "FreePlay Toronto, 300 College St, Toronto, ON, M5T 1R9",
        "sorting_info": [
            0,
            "Uncategorized",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca/sites/default/files/styles/headshot_1_1_800/public/assets/images/55119b89-cbb2-b40b-1656-d2dfd7c0b606.png?itok=G-ji1z52"
    },
    {
        "name": "Will and Harper Screening",
        "desc": "Commemorate International Transgender Day of Visibility, in community. Out@Innis invites you to watch a free screening of the award-winning documentary, Will and Harper (2024), starring Harper Steele and Will Ferrell on a cross-country road trip. Arrive early for snacks. Stick around for a Q&A after the screening with Angie Fazekas, assistant professor at the Women and Gender Studies Institute (pictured).",
        "location": "Screening Room 222E, Innis College, 2 Sussex Ave.",
        "sorting_info": [
            1733005200,
            "Social",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/2025-03-31-Will-and-Harper-Website-Header-1024x576.jpg"
    },
    {
        "name": "Kensington Market: Heart of the City",
        "desc": "The Urban Studies Program and the Canadian Film Forum present a special screening of Kensington Market: Heart of the City. On April 8, join for a screening of this documentary film followed by a discussion with filmmaker Stuart Clarfield. Kensington Market: Heart of the City tells the story of generations who have lived in the neighbourhood over the last 160 years, the personalities present today, and the forces that are impacting the market’s future. This film explores the rich community in the market, the pressures it faces under developers and landlords, and hopes to activate audiences to help protect the market for generations to come. Film run time: 104 minutes.",
        "location": "Innis Town Hall, 2 Sussex Ave",
        "sorting_info": [
            1733605200,
            "Academic",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/KM-16-9-Poster-BG-Large-1024x600.jpeg"
    },
    {
        "name": "2025 Innis Alumni Lecture",
        "desc": "Join us on April 9 for our 2025 Innis Alumni Lecture, “Can ‘Ex-Cons’ Help Improve the Criminal Justice System?“, with Professor Jeffrey Ian Ross (BA ’85 Innis). The criminal justice system struggles with entrenched issues that demand a fundamental re-evaluation. What if we used the voices of well-educated formerly incarcerated individuals to drive meaningful reform? Drawing from the Convict Criminology perspective, which amplifies the voices of those who have lived experience, this talk will explore how CJS reform could be improved by incorporating their expertise. After the lecture, Professor Scot Wortley from the Centre for Criminology & Sociolegal Studies will join to moderate the discussion and Q&A.",
        "location": "Innis Town Hall, 2 Sussex Ave",
        "sorting_info": [
            1744249200,
            "Academic",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/2025-Alumni-Lecture-Event-Page-Banner-1-1024x576.jpg"
    },
    {
        "name": "Innis Leadership Awards Application Deadline",
        "desc": "Get the recognition you’ve earned. Apply for Innis leadership awards. Have you volunteered at the College, on campus, or in your community? Innis wants to hear about your contributions and recognize you. Take a look at our many leadership awards. Ranging from approximately $500 to $11,000, we have awards for students in all years. The application deadline is April 14 at 11:59pm EDT.",
        "location": null,
        "sorting_info": [
            1744679940,
            "Academic",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Innis-College-Early-Years-Convocation-7-1024x576.jpg"
    },
    {
        "name": "Toronto Serbian Film Festival – Pun Gas!//First Class: Full Speed!",
        "desc": "Rivals Beba and Nemac as they race iconic Yugos, chasing the national championship and their dreams of Formula 1.",
        "location": "Innis Town Hall",
        "sorting_info": [
            1711747800,
            "Social",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/24th-TSFF-_Students_1920x1080-1024x576.png"
    },
    {
        "name": "Masked at the Movies presents Marcel the Shell with Shoes On",
        "desc": "A mask-mandatory screening of Marcel the Shell With Shoes On.",
        "location": "Innis Town Hall",
        "sorting_info": [
            1711825200,
            "Social",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Masked-At-The-Movies-Marcel-1-1024x576.png"
    },
    {
        "name": "CSI 50th Anniversary Screening Series: Splice",
        "desc": "The Cinema Studies Institute celebrates its 50th anniversary with a screening series of films picked by notable CSI alumni. Screenings will be followed by a discussion between the alumni and a CSI faculty member. All are welcome. Seats are first come, first serve. Doors open at 6:30pm. Claim your free ticket at Eventbrite. Splice is a 2009 science fiction horror film directed by Vincenzo Natali and starring Adrien Brody, Sarah Polley, and Delphine Chanéac. The story concerns experiments in genetic engineering being done by a young scientific couple, who attempt to introduce human DNA into their work of splicing animal genes resulting in the creation of a human–animal hybrid.",
        "location": "Innis Town Hall",
        "sorting_info": [
            1711933200,
            "Academic",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Splice-static-image-with-Simard-and-Russell-QR-code-Mar19-1024x576.jpg"
    },
    {
        "name": "Will and Harper Screening",
        "desc": "Commemorate International Transgender Day of Visibility, in community. Out@Innis invites you to watch a free screening of the award-winning documentary, Will and Harper (2024), starring Harper Steele and Will Ferrell on a cross-country road trip. Stick around for a group discussion and snacks after the screening.",
        "location": "Room 222E, Innis College, 2 Sussex Ave.",
        "sorting_info": [
            1711922400,
            "Social",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/WILL-HARPER-1-2-1024x576.png"
    },
    {
        "name": "AD HOC #73: Lulu Faustine, with the filmmakers in person!",
        "desc": "Innis College, room 222 April 3, 2025, 8PM Free admission, open to the public! A miracle happened: summer came ahead of time. “Stephen Broomer’s Lulu Faustine is an homage to the Latin American literary science fiction classic, Adolfo Bioy Casares’ The Invention of Morel, in which a fugitive escapes to an island and becomes enamoured with a woman, like a future Eve. This woman, Faustine, recorded by a machine, in her concept and abstraction, becomes the conducting thread of all the ideas that traverse Broomer’s film. Like Morel (and the fugitive), the filmmaker designs this feminine figure through digital codes, giving her a new texture. It’s Lulu who scapes the expressive humanity of Pabst, to be molded to the eyes of a different creator, many years after, given new life with the help of technology.” Mónica Delgado, Desistfilm To be in love with an image was worse than being in love with a ghost. (I feel as if my tympanum were breaking.) Almost everything, in fact, does have an explanation. (Atmospheric pressure is increasing…). “Lulu Faustine becomes a film about Faustine and (Louise) Brooks—at once speaking to its literary source, the films that provide its images, and Joseph Cornell’s collage film Rose Hobart, all of which provide pathways through its hypnotic imagery.” Ben R. Nicholson, Sight and Sound The remaining chapters will hold no surprises. (…and I feel as if my tympanum were breaking.) To be on an island inhabited by artificial ghosts was the most unbearable of nightmares. (12.30 o’clock, respiration is extraordinarily difficult.) I have given you a pleasant eternity! Just me for you and you for me alone. (I am intoxicated with gasoline.) It will be an act of piety. Stephen Broomer is a filmmaker born in Toronto, Canada. His films have been the subject of retrospectives at Anthology Film Archives (New York), the Pleasure Dome (Toronto), and the Canadian Film Institute (Ottawa). Broomer’s work has been the subject of an essay collection, The Transformable Moment (2014), and he has been a Fulbright scholar with the Prelinger Library (San Francisco). In his role as a historian of Canadian cinema, Broomer has written three monographs, co-authored a textbook, and co-edited two collections of essays on essential contemporary Canadian filmmakers. He is the founder of the home video label Black Zero, dedicated to Canadian experimental cinema, and he is the creator and host of Art & Trash, a video essay series on underground cinema. He teaches cinema studies at Innis College, University of Toronto. Stuart Broomer is a writer and musician. From the mid-1960s to the mid 1980s he was involved as bassist, pianist and composer in the Canadian free jazz and improvised music communities, releasing LPs with saxophonist Bill Smith and percussionist John Mars. He has written on music for The Globe & Mail, Toronto Life, Coda, Musicworks and New York City Jazz Record. His column “Ezz-thetics” appears regularly at pointofdeparture.org. His soundtracks for feature films by Stephen Broomer include Potamkin, Tondal’s Vision, Phantom Ride, Lulu Faustine and Fat Chance (2017-2021). Programme: Lulu Faustine (2020, 65 mins.) TRT: 65 minutes AD HOC aims to rethink what an experience of cinema can be. We seek to reposition historical landmarks and buried treasures within the on-going tradition of experimental and other non- commercial modes of filmmaking, drawing on work from Toronto, throughout Canada, and internationally. Within these parameters, we aspire to diversity in programming, as well as to multimedia and interdisciplinary screening events that bring together varied communities. AD HOC = Stephen Broomer, Madi Piller, Jim Shedden, Bart Testa. AD HOC would like to thank Alberto Zambenedetti, Denise Ing, Charlie Keil, Eyan Logan, Rob Trevisan, Thom Chan, Jarret Sorger, and the staff of Innis College and the Cinema Studies Institute.",
        "location": "Innis College, room 222",
        "sorting_info": [
            1738263600,
            "Academic",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/Glx8hgbXIAAC2De-1024x683.jpeg"
    },
    {
        "name": "America Is Being Beaten: Visions of the Imperiled Child in Freud, D.W. Griffith, and Arthur Jafa.",
        "desc": "Ara Osterweil is a writer, painter, and scholar of 20th-21st century film and art, and an Associate Professor at McGill University.",
        "location": "Room 222E, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1743714000,
            "Academic",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/1-Painter-Ara-Osterweil-in-front-of-her-Meridien-100-x-90.-Photo-by-David-Baumflek.-@davidbaumflek_studio.jpeg"
    },
    {
        "name": "Toronto Serbian Film Festival – Devil's Town // Djavolja Varos",
        "desc": "Join us for a special retrospective screening of Devil’s Town (Đavolja Varoš) with director Vlada Paskaljević in-person to share bts stories.",
        "location": "Innis Town Hall, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1712365200,
            "Uncategorized",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/24th-TSFF-_Students_1920x1080-1024x576.png"
    },
    {
        "name": "Toronto Serbian Film Festival – Cat’s Cry // Mačji Krik",
        "desc": "The film follows a couple fighting for custody of their granddaughter. Director Sanja Živković will join us in-person post-screening!",
        "location": "Innis Town Hall",
        "sorting_info": [
            1712365200,
            "Uncategorized",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/24th-TSFF-_Students_1920x1080-1024x576.png"
    },
    {
        "name": "Rudolf Arnheim’s Media Theory: Formats, Platforms, Materials, and the Cinema",
        "desc": "Today, the legacy of classical film theory – with its insistence on medium specificity and concern with the formal properties of film– is often framed as essentialist, ahistorical, and no longer applicable to our present media practices. As recent media-theoretical debates challenge the very association of media with the material basis of artistic or communication devices, several scholars have shifted their focus to the categories of formats and platforms, while others proposed to new conceptual formations such as elemental media, operational media, and environmental media. This lecture seeks to complicate such views regarding the distinction between the classical and current theoretical debates by drawing attention to more dynamic and historically-contingent aspects in classical film theory’s conceptions of media. Specifically, my focus is on the writings of Rudolf Arnheim, perhaps the film theorist most identified with a rigid formalist view of medium specificity. Yet, as this lecture details, Arnheim’s conception of the film medium was far more complex than merely considering it as the material support of moving images. His thoughts on media across the eight decades of his extraordinary long career prompt us to adopt a distinct understanding of medium, while also revealing that the notions of platforms and formats already introduced themselves as vital critical categories in the context of the transformation of cinema during the twentieth century. Doron Galili is an associate professor and researcher in the Department of Media Studies at Stockholm University. He is the author of Seeing by Electricity: The Emergence of Television, 1878-1939 (Duke University Press, 2020) and coeditor of Corporeality and Early Cinema: Viscera, Skin, and Physical Form (Indiana University Press, 2018).",
        "location": "Room 222E, Innis College, 2 Sussex Ave, Toronto, ON",
        "sorting_info": [
            1733504400,
            "Academic",
            "Innis College"
        ],
        "posted_time": 0,
        "image": "https://innis.utoronto.ca/wp-content/uploads/DORON-GALILI-PIC.jpg"
    },
    {
        "name": "Kensington Market: Heart of the City",
        "desc": "The Urban Studies Program and the Canadian Film Forum present a special screening of Kensington Market: Heart of the City. On April 8, join for a screening of this documentary film followed by a discussion with filmmaker Stuart Clarfield. Kensington Market: Heart of the City tells the story of generations who have lived in the neighbourhood over the last 160 years, the personalities present today, and the forces that are impacting the market’s future. This film explores the rich community in the market, the pressures it faces under developers and landlords, and hopes to activate audiences to help protect the market for generations to come. Film run time: 104 minutes.",
        "location": "Innis Town Hall",
        "sorting_info": [
            1744168800,
            "Social",
            "Innis College"
        ],
        "posted_time": "2025-03-18 04:40:38",
        "image": "https://innis.utoronto.ca/wp-content/uploads/KENSINGTON-1024x576.png"
    },
    {
        "name": "Wake Up Toronto – Mindfulness Practice Session: in-person",
        "desc": "Wake Up Toronto is a mindfulness group that practices in the tradition of Engaged Mindfulness, founded by internationally recognized scholar, peace activist and Zen Master Thich Nhat Hanh. We are a branch of the international Wake Up initiative which fosters inclusive spaces for developing compassionate communities. The Wake Up initiative is for young adults in their 20s and 30s-ish. Open to students, faculty, staff and the general public. The skillsets and aims of our practice group align with several of the recommendations made by the University of Toronto’s Mental Health Task force. Speakers/facilitators for these sessions are comprised of students, faculty and community members trained in the mindfulness tradition of Thich Nhat Hanh and Plum Village. New and long-term meditators welcome! Each week we explore different topics, try out a variety of practices and have time for discussion and community connection. Join us for Wake Up Toronto on Mondays for an in-person Mindfulness Practice Session.",
        "location": "569 Spadina Avenue, Main Activity Hall, 2nd Floor",
        "sorting_info": [
            1732917600,
            "Mental Health",
            "New College"
        ],
        "posted_time": 0,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/Mindfulness-Practice-Sessions-inperson.png"
    },
    {
        "name": "Women and Gender Studies Institute: Book Talk: Fighting Feelings",
        "desc": "Join the Women and Gender Studies Institute for a book talk with Dr. Gulzar R. Charania in conversation with Dr. R. Cassandra Lord and Dr. Sheila Batacharya discussing Dr. Charania’s book Fighting Feelings: Lessons in Gendered Racism and Queer Life. Racialized women and girls often feel racial injustice before they have the words to name it. Sometimes they fight these feelings, and sometimes they use these feelings to fight. In this important and revealing book, Gulzar R. Charania puts the experiences of women of colour at the centre of her investigation, sharing how they endure everyday racism, as well as its lasting impacts and exacting costs in their lives and educational trajectories. Fighting Feelings highlights how the elasticity of white supremacy invites people of colour to be its accomplices, how interlocking forms of oppression force racialized queer women to calibrate the risk of expressing their sexuality, and how schools and the nation inform the development of racial literacy. Charania traces the complex convergences, and inseparability, of race, class, gender, and sexuality in women’s lives, and the divergent political horizons that racism fosters. Told through a clear analytic lens, Fighting Feelings articulates racism as a structure, and explores the myriad ways it shapes the lives and political formation of women of colour. Charania’s analysis of the complexity of racism makes this book a critical and necessary contribution to our understanding of how white supremacy operates.",
        "location": "Wilson Hall, Room 2007D - 40 Willcocks Street, Toronto",
        "sorting_info": [
            1733025600,
            "Academic",
            "New College"
        ],
        "posted_time": 0,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/Apr-1-Gulzar-Charania-Book-Talk400x203.png"
    },
    {
        "name": "Urban Pictograms – a Public Art Installation With Kaethe Wenzel",
        "desc": "Join us on Thursday, April 3 with Berlin-based artist Kaethe Wenzal to launch Urban Pictograms — a Public Art Installation at D.G. Ivey Library. Wenzel will be selecting a number of pictograms from the Urban Pictograms Workshop to display.",
        "location": "D.G. Ivey Library New College, 20 Willcocks Street, Toronto",
        "sorting_info": [
            1741056000,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 0,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/KaetheWenzel-pictographs.png"
    },
    {
        "name": "Women and Gender Studies Institute: Book Launch: Indenture Aesthetics",
        "desc": "Join the Women and Gender Studies Institute for the launch of Jordache Ellapen’s book, Indenture Aesthetics: Afro-Indian Femininities and the Queer Limits of South African Blackness. In Indenture Aesthetics, Jordache A. Ellapen examines the visual and performance art practices of feminist, queer, femme, and gender-nonconforming Afro-Indian and South African black artists to understand the paradoxes of freedom in contemporary South Africa.",
        "location": "William Doo Auditorium, New College at 45 Willcocks Street, Toronto",
        "sorting_info": [
            1743120000,
            "Academic",
            "New College"
        ],
        "posted_time": 0,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/Mar-28-Indenture-Aesthetics-Launch-400x400-1.png"
    },
    {
        "name": "Public talk: Urban organisms. Re-imagining urban ecologies and collective futures with Kaethe Wenzel",
        "desc": "Join us in welcoming Berlin-based interdisciplinary artist Kaethe Wenzel. Wenzel has used a diverse variety of media and material such as textiles, found items, animal bones, plants, soil and other organic material, as well as small electronics to produce urban interventions and objects of speculative fiction at the intersection of art, science and technology. Wenzel challenges the notion of the artwork as an object to be observed in a gallery or museum, and the gallery as a constrained space with relatively limited interactions. Her extensive body of work extends to building facades, billboards, entire neighborhoods and the city, translating into urban interventions to explore the collective production of culture and the creation and negotiation of public space.",
        "location": "The Fields Institute for Research in Mathematical Sciences, Rm. 230- 222 College Street",
        "sorting_info": [
            1743123600,
            "Academic",
            "New College"
        ],
        "posted_time": 0,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/KaetheWenzel-Cell-Image.png"
    },
    {
        "name": "Write Night",
        "desc": "Are those end-of-term deadlines adding up? The New College Writing Centre and D.G. Ivey Library have teamed up for the return of Write Night on Wednesday, March 26 in the D.G. Ivey Library from 4:30-9 p.m. Join us for an evening filled with focused, friendly, stress-free support whether you're still settling on a research topic, drafting final papers or making final revisions we have the tools to help get over those final finish lines. Write Night combines the best of what the Writing Centre and Library have to offer plus a few extra exciting additions: > On-the-spot, one-on-one consultations with writing instructors and librarians > Quiet spaces to write alongside peers > Mindfulness activities and wellness breaks to recharge your body and mind > Helpful strategies to meet deadlines no matter where you are in the process > Writing Workshops > Raffle prizes > And dinner is on us for all pre-registered attendees! (catered) Join us as we take over the library and tackle those deadlines head-on - Register Now! Write Night is open to New College students and students enrolled in a New College-affiliated program or course (Critical Studies in Equity and Solidarity, NewOne, BPMH, African Studies, Caribbean Studies, Women Genders, or Human Biology) working on papers.",
        "location": "D.G. Ivey Library, New College - 20 Willcocks Street",
        "sorting_info": [
            0,
            "Uncategorized",
            "New College"
        ],
        "posted_time": 0,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/WriteNight_370x270.png"
    },
    {
        "name": "Urban Pictograms Workshop with Kaethe Wenzel",
        "desc": "A workshop to challenge the urban rules and cultural stereotypes of street signs. This workshop is part of the programming of the NewONE: Learning without Borders, New College, University of Toronto. Throughout the academic year, our classes have been exploring important issues pertaining to social justice. During this workshop, students and members of the community will work together to create urban pictograms (or urban stickers) that challenge inequalities and reaffirm principles of social justice.",
        "location": "William Doo Auditorium, New College at 45 Willcocks Street",
        "sorting_info": [
            1742470200,
            "Academic",
            "New College"
        ],
        "posted_time": 0,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/Poster-Kaethe-Wenzel-370-x-270-px-1.png"
    },
    {
        "name": "“Flourishing Kin” Indigenous Lifeways to Collective Flourishing with Dr. Yuria Celidwen",
        "desc": "How can Western and Indigenous sciences work together to recalibrate current practices in service of global well-being? Join Dr. Yuria Celidwen on Tuesday, March 18 from 5 – 7 PM at Seely Hall, Trinity College to explore relationality and flourishing through cultivating relationships toward all kin, from human to more-than-human. Our world faces crises that require a focus on community and planetary health and well-being, but the Western mindfulness movement is primarily focused on individual self-improvement. Dr. Yuria Celidwen will share insights from her recent book Flourishing Kin: Indigenous Wisdom for Collective Well-Being, bridging Indigenous ontologies and methodologies, academic research, and poetic expression to cultivate sustainable collective flourishing through Indigenous contemplative spiritualities and sciences. Celidwen defines relationality and flourishing as a spiritual-aesthetic arrest only possible in community through cultivating relationships toward all kin, from human to more-than-human, and the living Earth. Through poetic expression and authentic truth-telling, Celidwen invites a path that meets the world’s complexity with reverence and joyous participation in the flourishing of all living beings – RSVP Today!",
        "location": "Seeley Hall, Trinity College - 6 Hoskin Avenue. Toronto",
        "sorting_info": [
            1742346000,
            "Academic",
            "New College"
        ],
        "posted_time": 0,
        "image": "https://www.newcollege.utoronto.ca/wp-content/uploads/Dr.YuriaCelidwen-400x400-1.png"
    },
    {
        "name": "Research Day 2025",
        "desc": "Victoria College’s annual Research Day will take place on March 31, 2025. Research Day brings together Vic students from all disciplines and provides an opportunity to share your work with fellow students, professors, and the wider Vic community. If you have been conducting research in any discipline, you are encouraged to submit a proposal for an interdisciplinary poster session. All Vic students, and any students enrolled in Victoria College programs, are eligible to participate.",
        "location": "Victoria College Alumni Hall/ Foyer",
        "sorting_info": [
            0,
            "Uncategorized",
            "Victoria College"
        ],
        "posted_time": 0,
        "image": "https://www.vicu.utoronto.ca/assets/Uploads/OGImage/research-day-2.png"
    },
    {
        "name": "VWA | Victoria Women's Association Annual Luncheon",
        "desc": "Celebrate 127 years of the VWA with the Vic community over lunch and enjoy \"Women and Art at Victoria University,\" a talk by Gerrie Loveys.",
        "location": "Alumni Hall",
        "sorting_info": [
            1744782000,
            "Social",
            "Victoria College"
        ],
        "posted_time": 0,
        "image": "https://www.vicu.utoronto.ca/assets/Uploads/burwash.jpg"
    },
    {
        "name": "Victoria College Open House | Open Vic 2025",
        "desc": "Join us at our annual Open Vic on Saturday, June 14, from 10 a.m. to 4 p.m. We will be welcoming incoming students and their guests to campus for an afternoon filled with meet and greets, academic advising, tours, information booths and more. Lunch will be served. This event is for Faculty of Arts & Science students who are admitted to Victoria College for the 2025-26 academic year.",
        "location": "Old Vic, 73 Queen's Park Crescent, Toronto, Ont.",
        "sorting_info": [
            1749934800,
            "Academic",
            "Victoria College"
        ],
        "posted_time": 0,
        "image": "https://www.vicu.utoronto.ca/assets/Uploads/Vic-U-News/open-vic-victoria-college.jpeg"
    },
    {
        "name": "Virtual and In-Person Information Sessions for Prospective Students",
        "desc": "Find out more about the Trinity One program and how it can fit into your first-year university experience. Join our online session hosted by our Program Coordinator, Program Assistants, and Peer Mentors. Learn about our program and have your questions answered in a small-group, interactive, virtual session.",
        "location": null,
        "sorting_info": [
            1732798800,
            "Academic",
            "Trinity College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "Book Launch: East of Empire: Egypt, India, and the World Between the Wars",
        "desc": "Join Cambridge historian Erin O’Halloran and bestselling author and former Trinity College Provost Margaret MacMillan for a discussion of Dr. O’Halloran’s new book East of Empire: Egypt, India, and the World Between the Wars.",
        "location": "Trinity College - Seeley Hall",
        "sorting_info": [
            1743462000,
            "Academic",
            "Trinity College"
        ],
        "posted_time": 0,
        "image": "https://www.trinity.utoronto.ca/wp-content/uploads/2025/03/EastofEmpireMar31Poster.png"
    },
    {
        "name": "International Day of Commemoration in Memory of the Victims of the Holocaust",
        "desc": "Created in 2005 by the United Nations General Assembly, the International Day of Commemoration in Memory of the Victims of the Holocaust encourages remembrance, reflection, and education about the causes and consequences of the Holocaust. The Holocaust claimed the lives of more than six million Jewish men, women, and children as well as members of other persecuted populations, including members of Romani communities, LGBTQ+ individuals, persons with disabilities, and political dissidents.",
        "location": null,
        "sorting_info": [
            0,
            "Academic",
            "Trinity College"
        ],
        "posted_time": 0,
        "image": "https://people.utoronto.ca/wp-content/uploads/2024/01/UofT88616_u-of-t-engineering_51682078896_o.jpg"
    },
    {
        "name": null,
        "desc": null,
        "location": null,
        "sorting_info": [
            0,
            "Uncategorized",
            "Trinity College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "International Day of Commemoration in Memory of the Victims of the Holocaust",
        "desc": "Created in 2005 by the United Nations General Assembly, the International Day of Commemoration in Memory of the Victims of the Holocaust encourages remembrance, reflection, and education about the causes and consequences of the Holocaust. The Holocaust claimed the lives of more than six million Jewish men, women, and children as well as members of other persecuted populations, including members of Romani communities, LGBTQ+ individuals, persons with disabilities, and political dissidents.",
        "location": null,
        "sorting_info": [
            0,
            "Academic",
            "Trinity College"
        ],
        "posted_time": 0,
        "image": "https://people.utoronto.ca/wp-content/uploads/2024/01/UofT88616_u-of-t-engineering_51682078896_o.jpg"
    }
]