[
    {
        "name": "Smartphone Photography 101",
        "desc": "The sun is setting and the sky is alight with oranges and pinks, so you pull out your phone to snap a pic for the 'gram. But the photo just looks...meh. Find out how to maximise your cell phone's camera in this event featuring Shlomi Amiga, who will teach you the basics of photography. Learn how to find the best light, the science of angles and composition, and how to make your photos pop in this hybrid lecture. In-person attendees will then have the opportunity to photograph University College and the University of Toronto at sunset, then return for a reception and a chance to show off what they learned. In person attendees should bring a fully-charged smartphone to the event. Reserve your spot now by registering for this event today. Registration is required. MindSpark! Offering our alumni ways to learn, interact, and reconnect with UC through unique and engaging events.",
        "location": "University College, 15 King’s College Circle, Toronto ON M5S 3H7",
        "sorting_info": [
            1713848400,
            "Alumni",
            "University College"
        ],
        "posted_time": 0,
        "image": "https://www.uc.utoronto.ca//sites/default/files/styles/banner_scale_width_crop_1460/public/assets/banners/content/Smartphone%20Photography%20Banner%203%20v3.png?itok=wjdUeTDx"
    },
    {
        "name": "2025-26 Neil Graham Lecture in Science",
        "desc": "The Neil Graham Lecture series was established through the generosity of Mr. Neil Graham, a 1930 graduate of University College and a former teacher of high school mathematics. 2025 event details forthcoming.",
        "location": null,
        "sorting_info": [
            1761195600,
            "Endowed Lecture Series",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "2025-26 W. J. Alexander Lecture in English Literature",
        "desc": "The Alexander Lectures were founded in 1928 in memory of Professor W.J. Alexander, Head of the Department of English at University College from 1889 to 1926.",
        "location": null,
        "sorting_info": [
            1774953600,
            "Endowed Lecture Series",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "Academic Bridging Program Info Session",
        "desc": "Curious to learn more about the Academic Bridging Program? Ask your questions at one of our virtual information sessions. The next info session will take place March 27, 2025.",
        "location": "Online",
        "sorting_info": [
            1711502400,
            "Uncategorized",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca/sites/default/files/styles/landscape_16_7_1326x663/public/assets/images/Stocksy_txp3908a772dhQ300_OriginalDelivery_1032694.jpg?itok=DCb2g786"
    },
    {
        "name": "Academic Bridging Program Info Session",
        "desc": "Curious to learn more about the Academic Bridging Program? Ask your questions at one of our virtual information sessions. The next info session will take place April 1, 2025.",
        "location": "Online",
        "sorting_info": [
            1711938000,
            "Uncategorized",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca/sites/default/files/styles/headshot_1_1_800/public/assets/images/Stocksy_txp3908a772dhQ300_Medium_2604619%20%282%29.jpg?itok=iKy1L7Q7"
    },
    {
        "name": "Morley Gunderson Lecture in Industrial Relations and Labour Economics",
        "desc": "Join us on Thursday, April 3rd for the 2025 Morley Gunderson Lecture in Industrial Relations and Labour Economics,&nbsp;Time: At Work and Not at Work, delivered by Daniel Hamermesh, professor emeritus of economics at Royal Holloway University of London &amp; University of Texas at Austin.",
        "location": "Online &amp; at the Paul Cadario Conference Centre, University College, 15 King's College Circle, Toronto, ON M5S 3H7",
        "sorting_info": [
            1712121600,
            "Alumni",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca//sites/default/files/styles/scale_width_811px_/public/assets/images/Blue%20and%20Pink%20Professional%20Business%20Strategy%20Presentation.jpg?itok=xbMdJWMC"
    },
    {
        "name": "2nd Annual Woodsworth Alumni Game Night!",
        "desc": "Calling all Woodsworth alumni—it’s time to press play on an unforgettable night of friendly competition, nostalgia, and great company! Whether you’re a board game strategist, an arcade legend, or just in it for the laughs, this event is your chance to relive the best kind of campus rivalry—minus the exams and 8 a.m. classes.This isn’t just another game night—it’s the ultimate alumni experience. Here’s what’s in store:All-you-can-play access&nbsp;to classic and modern gamesDrink ticket&nbsp;and appetizers—because you play better when you are happyA room full of fellow alumni—reconnect, reminisce, and maybe settle some old scoresThe ultimate throwback experience—minus the exams and 8 a.m. classes, WooHoo!Date: Thursday, April 24Location:&nbsp;Free Play Toronto (300 College St)&nbsp;Time: 6:00 PM – 9:00 PMTickets: $15 (Includes cover, unlimited free play, one premium drink ticket, and appetizers)Whether you're looking to dominate the competition or just enjoy a laid-back evening with fellow alumni, this is an event you don’t want to miss. Tickets are limited, so secure yours now and get ready for a night of games, memories, and fun!RSVP by April 10th, 2025—spots are limited!&nbsp;",
        "location": "FreePlay Arcade, 300 College St, Toronto, ON, M5T 1R9",
        "sorting_info": [
            1740247200,
            "Alumni",
            "Woodsworth College"
        ],
        "posted_time": 0,
        "image": "https://wdw.utoronto.ca/sites/default/files/styles/headshot_1_1_800/public/assets/images/55119b89-cbb2-b40b-1656-d2dfd7c0b606.png?itok=G-ji1z52"
    }
]