[
    {
        "name": "Toronto Aesthetics Sciences Conference (TASC) 2025",
        "desc": "Mark your calendars! Join us for the insightful Toronto Aesthetics Sciences Conference (TASC) on April 8th at the Paul Cadario Conference Centre at University College, from 8:30 AM to 5:30 PM. For more information, please click here. Please note that registration is required for this event. If you wish to present, please enter a title, authors, and an abstract (max. 1000 characters, about 200 words) for your work in the form. Due to limited presentation slots, we cannot guarantee that all submission requests will be accepted for presentation. Refreshments and lunch will be provided. Registration deadline: Friday, February 28, 2025 (11:59 PM)",
        "location": "Paul Cadario Conference Centre at University College",
        "sorting_info": [
            "Apr 07, 2024",
            "Conference",
            "University College"
        ],
        "posted_time": 0,
        "image": "https://www.uc.utoronto.ca//sites/default/files/styles/scale_width_content_600/public/assets/images/UofT87286_u-of-t-engineering_50814475202_o.jpg?itok=4XA_F3ZM"
    },
    {
        "name": "2025-26 Neil Graham Lecture in Science",
        "desc": "The Neil Graham Lecture series was established through the generosity of Mr. Neil Graham, a 1930 graduate of University College and a former teacher of high school mathematics.",
        "location": null,
        "sorting_info": [
            "Oct 23, 2025",
            "Endowed Lecture Series",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    },
    {
        "name": "2025-26 W. J. Alexander Lecture in English Literature",
        "desc": "The Alexander Lectures were founded in 1928 in memory of Professor W.J. Alexander, Head of the Department of English at University College from 1889 to 1926.",
        "location": null,
        "sorting_info": [
            "Mar 31, 2026",
            "Uncategorized",
            "University College"
        ],
        "posted_time": 0,
        "image": null
    }
]